# scripts/build_mak_008a_part2.py

lines = [
    # 274 - 283
    "虽说豪言壮语揽下了大修包票……但这车……原本的原型底子到底是什么型号啊……？",
    "翻看证件上登记的车辆型式代码，大体上像是越野车……或者说是林道双运动越野车（Trail）为底盘基底改造的，然而――",
    "发动机型号代码与车体大梁的代码前缀完全对不上……难道是后期移植替换了异种车型的发动机吗……？",
    "@雄二@「乱改一气毫无章法啊……话说回来，这辆破车的点火钥匙到底该往哪里插？」",
    "在前叉龙头联板（Top Bridge）附近根本摸不到锁孔。我前看后看左看右看反复扫视，终于在主坐垫右侧下方的镂空副车架处找到了被移位改迁的钥匙孔。",
    "事不宜迟，我当即插进钥匙向右轻轻一拧――",
    "孤零零悬挂在油箱左侧外壁上的改装迷你复古单表盘内，莹绿色的空挡指示灯（N灯）与猩红色的机油报警灯瞬间双双亮起。",
    "@雄二@「电瓶蓄电池似乎还活着啊…」",
    "我伸手搭住右侧把手，摸索着寻找电启动打火按键（Self-starter），结果依然空空如也连个按钮都没有。",
    "定睛仔细打量发动机机匣，启动马达早就被彻底拆除扒光，原本的安装孔洞被简单粗暴地嵌死了一枚纯黑无孔橡胶盲塞。",

    # 284 - 293
    "@雄二@「纯靠脚踢启动踩发吗…」",
    "我不禁有些想要咂舌，转头打量车身右侧，下方果然孤零零伸着一根机械踩发踏杆。",
    "那根启动踏杆明显是手工锻造定制的异形弯曲结构，多半是为了在向下猛力踩发时不至于磕碰干涉到脚踏脚踏板吧。",
    "@雄二@「左脚是前置前移踏板，右脚却是中置脚踏……简直匪夷所思……唯一值得庆幸的大概是没装自杀档骑师档杆（Jockey Shift）吧…」",
    "大概是因为后轮采用了机械钢索拉线的鼓式刹车吧，但左右两边脚踏位置一前一后严重不对称，骑乘姿势别扭得令人反胃。",
    "一旦挂挡起步跑起来倒也能把右脚一并架到前保险杠踏棍上，可这样一来便无法随脚踩刹车，危险系数更加让人心里发毛…。",
    "@雄二@「…总之，先试着把发动机打着火再说…」",
    "拧开连防盗机械锁都没配的原油箱盖，往内一瞅，里面似乎规规矩矩灌着小半箱汽油――",
    "在盛夏烈日的暴晒下，油箱口升腾起一阵剧烈挥发、肉眼可见的滚滚汽油阳炎热浪。看来汽油尚且处于新鲜期，尚未变质胶化。",
    "我将油箱底部的燃油开关从『OFF』旋钮扳到『ON』挡位，把化油器侧面的冷车阻风门拉阀（Choke Plunger）拉出一半固定――",

    # 294 - 303
    "右脚稳稳踩上启动踏杆，轻柔下压摸索活塞压缩行程的上死点，待脚底清晰感受到那股沉重的压缩阻力感后，右腿聚力一脚狠狠踩到底！",
    "@雄二@「…哦？什么啊，这不是一脚就着了吗」",
    "对于长期闲置积灰的废旧改装车而言，这般痛快利落的着火反应反而顺利得有些叫人出乎意料。",
    "按理说被这么大肆拆改胡乱拼凑的鬼火车，十有八九脾气极其恶劣乖戾，动不动就闹别扭罢工才对…。",
    "@雄二@「天音那丫头，难道平时就算不骑也在背地里勤快地保养机油吗…？」",
    "――正当我对她暗自刮目相看赞许不已的刹那间，",
    "原本欢快亢进维持着微高怠速声浪的发动机，排气管末端突然“噗嗤”打了个喷嚏，紧接着毫无征兆地当场熄火哑火了。",
    "@雄二@「…哎呀……嘛，世事哪能真有一帆风顺的…」",
    "我不信邪地再次猛踩启动踏杆，可这一回发动机连哼都不哼一声，彻底没了声息，甚至连哪怕一丝电火花点火爆燃的微弱动静都感知不到了。",
    "@雄二@「…喂……不是吧开什么玩笑…？」",

    # 304 - 313
    "在盛夏毒辣烈日的酷热炙烤下，额头的汗珠大滴大滴顺着鼻尖噼里啪啦往下砸，我咬着牙反复奋力蹬踩启动杆。",
    "仪表盘上的绿色空挡灯明明亮如白昼，整车电气电路系统明明处于正常通电状态…。",
    "蓄电池虽然只装了一颗给轻便小踏板用的小容量免维护MF电瓶，但对于纯靠脚踩启动的单缸车而言按理说是绰绰有余的…。",
    "电路通路无恙却打不出高压火花……而且此前分明顺利着过一次火……这么说来，唯一的元凶便是……",
    "@雄二@「八成是CDI点火器烧了…」",
    "电容放电式点火控制器（Capacitor Discharge Ignition），通称CDI。乃是统管控制发动机点火时序的核心电子模块总称。",
    "在结构极度原始简朴的摩托车发动机部件中，这算是为数不多的精密电子总成元件――",
    "正因如此故障率居高不下，长期暴露在剧烈震动、发动机高温烘烤等恶劣极端工况下，冷不丁出现电气击穿或者虚焊失灵可谓家常便饭。",
    "@雄二@「该死……那女人的CDI到底藏在哪截线束里了啊…」",
    "我弯腰猫身探头望进油箱底部的阴影里，沿着高压点火线圈顺藤摸瓜一路排查主线束电缆…。",

    # 314 - 323
    "@雄二@「…不对……这是转向灯闪光继电器……这是大灯增光增压继电器……这坨黑乎乎的又是什么鬼？」",
    "@雄二@「这是保险丝盒吗？保险丝并没有烧断熔断……该死……热死老子了！！」",
    "整个人蹲在滚烫暴晒的铁架子车身旁埋头苦干，滴落的大颗汗珠瞬间在滚烫的水泥地面上砸出一个个焦黑的湿印。",
    "CDI……CDI……到底被塞到哪个狗窝里去了啊CDI……。",
    "顶着烈日沿着杂乱的防烫缠线包布顺藤摸瓜了足足十分钟之久吧？",
    "当我卸下坐垫左侧下方那块全车仅有的金属侧盖板时，",
    "赫然在整流稳压器（Regulator Rectifier）旁边，发现了一枚黑乎乎的四方盒子状塑料模块。",
    "@雄二@「…找到了！终于把这混账小王八蛋给揪出来了！！」",
    "我一把拔下连接主电缆线束的多针卡扣插头，举起单独拆下来的CDI盒子眯眼打量，表面看不出任何烧焦鼓包的痕迹。",
    "嘛，这种元件内部电路击穿原本就不是光凭肉眼凡胎能看出来的，",

    # 324 - 333
    "我用拇指指腹死死抵住黑色塑料外壳背面那层被环氧树脂封装胶层包裹的电子原件，用力使劲来回揉捏挤压按摩。",
    "如果点火失灵的病灶确实出在CDI内部焊点虚脱或电容微接触不良，这么施加外力有时能暂时奇迹般压紧焊点令其回光返照。",
    "这终究只是战地紧急应变时的下策偏方，根本无法根除隐患，但只要借此能让高压火花重现，便能铁板钉钉将故障源头锁定在CDI本体上。",
    "我将揉捏过的CDI重新插回电缆卡扣，深吸一口气再次猛踩下启动踏杆。",
    "@雄二@「…瞧吧！老子就说绝对是CDI在搞鬼！」",
    "虽然连我自己也分不清到底是在冲谁发泄怒气，但天音的这辆座驾——鲍巴太郎总算极其痛快地重新苏醒复活，",
    "粗犷沉郁的排气管里重新迸发出一阵阵节奏欢快硬朗的“咚咚咚咚”马蹄马力脉动声浪。",
    "@雄二@「…不过……这动静未免也太惊天动地了吧…」",
    "虽说比起那种尖锐刺耳的鬼火炸街噪音要顺耳得多，但要是拧大油门从放学的小学生身边呼啸而过，绝对会被人家满脸嫌恶地死死捂住耳朵抗议。",
    "@雄二@「没辙了……待会儿找几团钢丝球塞进消音塞里消消音吧…」",

    # 334 - 343
    "挂在空挡维持着怠速观察了好一阵子，发动机平稳运转丝毫没有再度熄火的迹象。",
    "看来并非CDI芯片彻底烧毁击穿，大概只是长期停放导致插头触点氧化接触不良罢了。",
    "我拧钥匙将发动机熄火，拔出机油尺检查了曲轴箱机油油位，顺便挨个测试了一遍前后转向灯与刹车灯尾灯。",
    "反复确认前后刹车咬合制动正常后，最后正打算测试胎压，却冷不丁倒吸了一口凉气。",
    "@雄二@「…哇靠真的假的，这后轮居然完全扎胎慢撒气扁成面饼了……要在这种见鬼的酷暑烈日下换胎补内胎吗……？饶了我吧…」",
    "我发出一声极度心力交瘁的长叹，仰头望天，鼻梁被午后的毒日晒得火辣辣发烫。",
    "心中虽然疯狂涌起“老子不伺候了爱谁谁”的摆烂冲动，可事到临头都折腾到这一步了再反悔改乘电车，那口气无论如何也咽不下去。",
    "@雄二@「这下可得……稍微费一番周折功夫了啊…」",
    "我喃喃自语着这番自暴自弃的嘀咕，决定先回宿舍大厅大口灌几杯冰水补充水分。",
    "原本我还破罐子破摔地琢磨着干脆把整颗轮毂扒下来扛回宿舍浴室里在水盆里查漏补胎，然而――",

    # 344 - 353
    "万幸的是根本没破大洞，拿打气筒吭哧吭哧几下一阵打气充填之后，轮胎便重新饱满坚挺地鼓胀了起来，因长期重压瘪陷形成的平斑凹陷也完好如初地彻底抚平。",
    "有内胎的辐条轮这玩意儿，为什么只要长期闲置不骑，内胆里的空气就会莫名其妙漏得一干二净呢…？",
    "抛开这桩千古未解之谜，待时钟敲响逼近正午的十一点整时，一切出征远征的筹备工序终于全线告罄。",
    "@雄二@「好嘞！各战位检查全员战备状态！？」",
    "@莳菜@「野餐便当准备完毕！私人手机充电完毕！饮用淡水储备完毕！国民健康保险证携带完毕！开拔出征！全线战备完好！！」",
    "@雄二@「很好！时间一一〇〇时！演习行动正式展开！全员登车！！」",
    "@莳菜@「游骑兵————！！」",
    "为了向山梨县发起势如破竹的进击，我意气风发地跨骑上“鲍巴太郎”，让莳菜坐稳后排单人皮革小座，死死环抱扣紧我的腰身――",
    "左脚脚尖咔哒一声狠狠将挡位踩进一档，右手缓缓松开发动机离合器大梁。",
    "@雄二@「…今天日头毒辣，防晒霜都有仔仔细细抹周全了吧？」",

    # 354 - 363
    "@莳菜@「嗯！万无一失的说！而且我把防晒霜乳霜也塞进随身包里了，随时随地都能补涂的说！」",
    "我和莳菜借用了狙击演习中佩戴的微功率对讲机（特小）与声带振动喉震麦克风，",
    "在调频FM专属波段保持着全程双向实时通话，一路沿着海岸线公路迎着温热的海风，慢悠悠地突突突巡航进发。",
    "@莳菜@「爸爸，你车技真稳耶！感觉比坐在天姐身后安全踏实多了。而且车速也没飙得那么夸张」",
    "@雄二@「是吗…？话说骑这种车还敢在公路上亡命狂飙的纯属没脑子的蠢货吧？」",
    "@雄二@「稍微压一点弯倾角脚踏就会直接刮地磨出火花。重心低虽是优点，但底盘贴地实在贴得太丧心病狂了…」",
    "虽然我也是破天荒头一回驾驭这种古怪的定制车，但像这样缀在前方车流屁股后面优哉游哉顺流巡航，倒也别有一番公路惬意。",
    "不过一旦杀进山路弯道，动力储备匮乏与底盘循迹操控笨拙的致命短板八成就要暴露无遗了吧…。",
    "@雄二@「也罢，不急不躁悠着点开便是…」",
    "@莳菜@「真羡慕爸爸和天姐啊……自己手里揣着驾照，随时随地想去哪兜风就能骑着车潇洒出发——」",

    # 364 - 373
    "@雄二@「莳菜你的法定年龄其实也已经够资格报考摩托驾照了，要不要抽空去考一个？」",
    "@莳菜@「唔……我之前也跟天姐这么提过哦？说我想去考个驾照」",
    "@莳菜@「结果她当场大喊大叫说什么太危险了绝对不行！自己明明整天跨在车上浪得飞起，却唯独禁足我不许骑，那女人到底有多双标自私啊」",
    "@雄二@「嘛，天音那份爱护关切的心情我倒也并非不能理解…」",
    "要是哪天莳菜真的考下了摩托驾照，跨上一辆轻便小踏板嚷嚷着『那我出去跟狐朋狗友鬼混咯——！』便一溜烟不知所踪――",
    "换成谁当家属，八成也得整天提心吊胆生怕交警或者急救医院突然打来病危通知电话吧…。",
    "小孩子这种生物，你单方面以危险为由粗暴没收禁止，到头来势必会背着监护人偷偷摸摸暗度陈仓。",
    "与其因噎废食，倒不如由大人规规矩矩倾囊相授安全防卫驾驶，这是我的行事逻辑……不过这或许也是大老爷们的思维模式吧。",
    "@莳菜@「换成是我，这种大家伙我也能骑得转吗…？」",
    "@雄二@「这个嘛……只要自行车骑得溜，两轮车走、拐、停的核心物理原理都是相通的，倒也不至于骑不来，但是……」",

    # 374 - 383
    "@雄二@「你跟天音不同，个头娇小手短脚短……在参透重心转移的巧劲之前，恐怕免不了要吃不少苦头」",
    "@莳菜@「果然还是太勉强了吗？」",
    "@雄二@「先从自行车开始苦练基本功。下回在学校后院的空地停车场，我带你跑跑金卡纳绕桩障碍赛（Gymkhana）吧…」",
    "@莳菜@「那是什么名堂？」",
    "@雄二@「掌握两轮机车操控核心、学习重心转移、轮胎接地抓地力面压与倾角负荷分配的最佳竞技训练。在固定标桩线路上比拼极限用时」",
    "@莳菜@「哼嗯~听起来超带感的样子耶？」",
    "@雄二@「在彻底摸出门道之前可是会摔得鼻青脸肿的哦？当年老子也是一路人仰马翻滚过来的」",
    "@莳菜@「顺便八卦一下，爸爸你第一次跨上摩托车骑行，是在几岁的时候啊？」",
    "@雄二@「大概是十四岁那年吧……当年和师父同住在山梨深山的私有林场里，第一次接触跨骑」",
    "没错，起初师父逼着我跨骑的是一台全尺寸高座高专业越野拉力赛车，因为双脚完全悬空沾不到地――",

    # 384 - 393
    "只能一只脚先踩上脚踏踏板，单手半联动挂挡起步溜车滑行，待车速起来保持平衡后，再如杂技飞身上马般翻身跨过车座据枪坐稳。",
    "起步固然这般惊险杂耍，停车制动同样是项苦力活，",
    "要么死死减速到即将倒车前如跳伞般仓促跳车空降着陆，要么就必须精准寻找路旁的岩石或者树桩伸脚死死抵住借力支撑。",
    "如今抚今追昔，当年的自己还真是身怀绝技硬核得不可思议。",
    "@莳菜@「感觉如何？最初第一次骑的时候果然吓破胆了吧？」",
    "@雄二@「既然本来就会骑自行车，当时倒也没觉得有多可怕就是了…」",
    "一方面是自己并未鲁莽进行超出负荷的自杀式狂飙，另一方面，或许是因为跟特勤任务中直面的那股真正命悬一线的“死亡恐惧”相比，单纯骑个车实在不值一提吧。",
    "当年我头一回顶替负伤的师父孤身潜入处决现场执行任务时，心头同样未曾感到过丝毫恐慌。",
    "拔除目标完成清剿，收枪归巢向师父提交战果报告，面对师父关切质问的“刚才害怕了吗？”，我当时内心麻木毫无波澜，甚至隐隐觉得兴奋与畅快。",
    "直到深夜万籁俱寂，洗漱完毕准备脱裤子排泄就寝的关键当口，我站在便池前掏出器官，却愕然发现自己无论如何也尿不出来――",

    # 394 - 403
    "就在那一瞬间，我才猛然惊觉，自己的整条手臂乃至每一根手指，都在止不住地疯狂剧烈颤抖痉挛。",
    "当一直死死紧绷到极致的杀戮神经终于松弛瓦解的刹那，排山倒海般的原始死亡恐惧宛如寒流般将我的四肢百骸彻底吞噬。",
    "哪怕稍有半步踏错便会死无葬身之地的凶险死局，自己居然毫无畏惧地凭借愣头青的好运气一跃踏了过来——在那个深夜，我甚至对虚无缥缈的幸运女神感激涕零。",
    "这种捡回一条狗命的侥幸绝不可能发生第二次。每每思及此处，浑身的冷汗便狂涌如注……即便时至今日，当年的战栗与惊骇依然历历在目。",
    "――然而，在接连品尝过数次那般近乎窒息的极度恐惧之后，我反倒逐步学会了如何驾驭与驯服自己的本能情绪……学会了如何在生死边缘提前嗅出杀机，从容闪避规避风险。",
    "@雄二@「…归根结底，无非是个脱敏与习惯的生理问题罢了」",
    "@雄二@「只要肉体沉淀出能嗅出危险的敏锐嗅觉，或者基于血泪经验累积出预判危险的战术第六感，一切便不足为惧」",
    "@雄二@「“今天的我状态爆棚、所向披靡”——每当产生这种虚妄错觉的时刻，往往才最具致命的杀伤危险。用大白话来讲，就是人一旦飘了就离摔得粉身碎骨不远了」",
    "@雄二@「两轮机车也是同样的道理。正如我教你骑自行车时强调的那样，眼观六路耳听八方，心怀从容留足安全冗余，便能安然无恙」",
    "@莳菜@「原来如此~也就是所谓的常态五成力，紧急提速七成力对吧？」",

    # 404 - 413
    "@莳菜@「一旦心头产生“好可怕”的畏惧感，车速往往已经飙过了八成极限。始终把巡航速度控制在“即将害怕”的前一档，才是最完美的姿态吧？」",
    "@雄二@「正是此理。顺便一提，老子现在正是以五成力的从容节奏在平稳巡航」",
    "@莳菜@「现在表显车速是多少码啊？」",
    "@雄二@「虽然不知道改装表盘准不准，但大致在时速五十公里上下」",
    "@莳菜@「懂了……也就是“感觉再快一点点也未尝不可”的那道临界线前一档呢」",
    "@雄二@「保持这个车速与跟车安全距离，哪怕前车突然操作失误一头骑上路沿石骤停，我也能在安全制动距离内轻松闪避解围」",
    "@莳菜@「安全才是最快的捷径，原来是这个意思啊！果然我也好想去考个摩托驾照啊——」",
    "“所谓两轮摩托车，究竟是怎样的一种载具？”",
    "面对莳菜先前的随口发问，我一时竟有些陷入沉思难辨字句。",
    "你还记得自己生平第一次学会骑自行车的那个午后吗…？",

    # 414 - 423
    "对莳菜而言，那不过是数天前刚刚经历的崭新体验，甚至可以说至今依然沉浸在破茧重生的巨大感动与余韵之中吧。",
    "初次靠双脚蹬踩离地远行、独自沿着从未踏足过的陌生地平线一路向远方奔驰的那一天，难道不曾体会过整个狭隘世界在一瞬间被彻底撕裂拓宽的震撼吗？",
    "原来这个世界的条条大路竟能无边无际向远方延伸，只要跨上车轮，便能前往遥不可及的彼岸。",
    "“我究竟能够走多远？能够抵达世界的哪一个尽头？”——是否也曾这般心潮澎湃地叩问过命运？",
    "而当我生平第一次跨上机动摩托轰鸣冲向荒原的那一天，那句“我究竟能走多远？”的疑问，在耳边呼啸的引擎轰鸣中，直接升华为了“无论何处我都誓必抵达！”的坚不可摧的执念。",
    "那绝非什么廉价的自我宣誓，而是人类在剥离一切虚妄外物、唯有凭借自我的钢铁意志去征服广袤大地时，所诞生的最高尊严。",
    "如果可以的话，我衷心期盼莳菜有朝一日也能在人生的旷野中，亲自去领略这番豪迈与自豪。",
    "正因如此，我绝不会像那些陈腐的监护人那样，以“危险”为由粗暴斩断她触碰世界的触角。",
    "@蒔菜@「啊！快看！爸爸！路边好多葡萄藤果园耶！」",
    "@雄二@「嗯，我们已经驶入山梨县辖区境内了」",

    # 424 - 433
    "@蒔菜@「好厉害！真的到处都是葡萄架耶！连电线杆子旁边都是葡萄！哇塞！一整片山坡全被葡萄霸占了的说！」",
    "@雄二@「毕竟这可是著名的甲斐甲州盆地。在日照充沛、排水良好的梯田斜坡上，最适宜栽种这类浆果果树」",
    "@蒔菜@「好想吃哦！要不要偷偷翻进果园里顺走两串啊？」",
    "@雄二@「你要是敢干这种偷鸡摸狗的勾当，老子当场就执行战场纪律把你枪毙在葡萄藤底下」",
    "@莳菜@「切~开个玩笑嘛！那咱们去路边的农产品直销摊子买一串总行了吧？」",
    "@雄二@「急什么，等扫完墓下山回程的时候再买也不迟」",
    "@蒔菜@「呜~……好吧……不过山梨这地方，除了葡萄就没别的特产了吗？」",
    "@雄二@「别把话说得好像山梨县穷得只剩葡萄一样。被甲州本地的乡党父老听见了，你可是会被人家乱棍打飞的哦？」",
    "@蒔菜@「为什么嘛？那除了葡萄还有啥好东西嘛？」",
    "@雄二@「……………………」",

    # 434 - 443
    "@雄二@「……水蜜桃…？」",
    "@蒔菜@「我看真正会被甲州乡亲乱棍打飞的其实是爸爸你吧！？」",
    "@雄二@「胡说八道！除了桃子，还有著名的甲州馎饦宽汤面（ほうとう）！还有信玄饼！名产多了去了好不好！少小瞧盆地特产啊混账！」",
    "@蒔菜@「我也没小瞧呀，葡萄和水蜜桃我都超爱吃的好不好！只是觉得跟冈山县的特产人设撞车重合了嘛！」",
    "@雄二@「…又在那里口无遮拦乱抖多余的机灵包袱……真是的，到底随了谁的嘴碎脾气，成何体统」",
    "@蒔菜@「依我看，多半是百分之百随了爸爸你的遗传呢！」",
    "@雄二@「…是吗，随我啊……咳，总而言之，你看那边，那些灌木是桑树。是给蚕宝宝当饲料口粮的桑叶」",
    "@蒔菜@「又冒出没听过的生词了。谁是蚕宝宝先生啊？」",
    "@雄二@「哇靠，你这丫头竟然连家蚕都不知道吗？蚕宝宝就是家蚕蛾的幼虫。吐丝结茧用来纺织丝绸，乃是扶桑自古以来立国的传统支柱产业之一啊」",
    "@蒔菜@「丝绸这种高级料子，居然是蛾子毛毛虫吐出来的幼虫分泌物吗！？」",

    # 444 - 453
    "@雄二@「真丝本来就是纯天然动物蛋白纤维。你连这等常识都一无所知吗？」",
    "@蒔菜@「就像用鲸鱼嘴里的鲸须做小提琴琴弓那样吗？」",
    "@雄二@「…虽然风马牛不相及……但不可思议的是，我居然能奇妙地领会你脑回路想表达的隐喻…」",
    "@莳菜@「我能跑去桑树地里近距离瞅一眼吗？」",
    "@雄二@「光是看看倒无妨……但绝对不许擅自把树上的桑葚果实摘下来往嘴里塞，听懂没？还有，把防晒遮阳帽戴严实了再下车」",
    "@蒔菜@「收到遵命！」",
    "话音未落，莳菜便如脱缰野马般跳下车座，在炎炎烈日之下张开双臂宛如幼鸟扑棱翅膀般欢天喜地冲向路旁的桑树田垄。",
    "那一蹦一跳的娇小背影，与她那单薄纤细的萝莉身架相映成趣，看起来当真如同一名不谙世事的稚嫩幼童。",
    "对世间万象皆保有着无限充沛的探索欲，一旦撞见未知盲区，便会立刻不耻下问扬起小脸追问“为什么呢？”。",
    "面对这样的莳菜，我竭力从自己过往荒芜的血腥阅历与枪械知识库中筛选词句为她悉心解惑，或者陪着她一同推演思考，而透过莳菜独特的童真视角与奇妙词汇，我往往也能从中获得前所未有的思想涤荡与全新顿悟。",

    # 454 - 463
    "这么一想，所谓向后辈传道受业解惑，对施教者自身而言，何尝不是一场深刻的修行与回炉重造呢。",
    "如今我看似成长为了能够独当一面处变不惊的成熟男人，可当年将立足处世的一切法理与本领毫无保留灌输给我的，既非我那早已支离破碎的血亲父母，亦非体制内的正规学堂教官，而是那个放荡不羁的女人…。",
    "――日下部麻子。",
    "那便是我毕生敬仰的师父的名讳，亦是塑造构成了如今风见雄二八成以上人格底层代码的核心人物。",
    "在我童年时代——更确切地说是犹如字面意义上被践踏在恶鬼深渊地狱时，唯一向我伸出救赎之手的神明。",
    "站在麻子的立场上，当年将垂死窒息的我从血泊尸堆中打捞领养回家，或许不过是顺水推舟的偶然，甚至是近乎心血来潮的一时兴起。",
    "但即便如此，若当年未能与麻子相遇，这世间便绝不可能存在如今的风见雄二；若未曾与她相拥，我恐怕早在多年前便已彻底放弃了苟活于世的权利。",
    "在那一天、那一秒、在那无可替代的关键时空交汇点上，是麻子强硬地牵起了我冰凉的手掌，而在麻子的周遭，还聚集着那帮性格古怪的同伴…",
    "特别是多亏了那个满头金发、整天神神叨叨惹人嫌厌的官僚女人（JB），方才有了今日站立于此的我。",
    "而时至今日，我依然将麻子弥留之际留给我的最后一句话铭刻在胸膛深处，以此作为支撑我迎接每一个黎明的唯一信条。",

    # 464 - 473
    "将我这等残破不堪的人渣废物苟延残喘留存于世，究竟能为这个冰冷的人间换来些什么呢…？",
    "我想，我之所以今天依然在此拼命呼吸生存，正是为了在未来的某一天，亲手找到属于这个问题的终极答卷吧。",
    "@蒔菜@「爸爸——！喂，爸爸——！」",
    "@雄二@「嗯？哦，怎么了…？」",
    "@蒔菜@「我去看过桑树林啦！里面趴着超多超巨大的天牛甲虫耶！」",
    "@雄二@「是吗……等等，喂！你嘴里啃的是什么玩意！？」",
    "@蒔菜@「诶？西瓜呀？你看，那边的田埂草棚下不是坐着一位劳作的农妇老奶奶嘛？是老人家慷慨打赏给我的的说（ずら）！」",
    "@雄二@「你这丫头……肯定又摆出一副眼巴巴馋得流口水的哈巴狗德行死死盯着人家的西瓜看对吧？有没有好好向人家道谢鞠躬？」",
    "@蒔菜@「那还用说嘛，我可是很讲礼貌地道过谢了的说（ずらよ）！」",
    "@雄二@「…这浓浓的『ずら』口癖算怎么回事…」",

    # 474 - 483
    "…不过是跟本地土生土长的村民攀谈了短短数分钟，居然就已经被同化传染了地道的山梨甲州方言口癖了吗…",
    "该夸这小丫头的环境适应机能堪称特工级怪物呢，还是该吐槽她意志力薄弱太容易随波逐流被外人带偏呢…。",
    "我快步走到莳菜身旁，面朝瓜棚里的农妇老妇人毕恭毕敬地深深鞠了一躬致谢。",
    "@雄二@「好啦，既然水份和糖分都补充得差不多了，咱们也该继续拔营开拔了」",
    "@蒔菜@「好咧！别磨磨蹭蹭的啦（わにわにしとらんで），麻溜开拔启程吧（ちゃっちゃと行けし）！」",
    "@雄二@「…我说你啊，那句甲州方言语法用得完全南辕北辙好不好…？」",
    "难道是陆上自卫队的野战特科炮兵部队，正在富士演习场用减装火药打靶慢吞吞地试射练兵吗？",
    "当宛如远方隐隐滚雷般的重炮轰鸣声开始隐隐震颤远方苍穹之际，属于我记忆中的那个山梨县的独特硝烟气味，终于愈发浓烈清晰地扑面而来。",
    "沿途在山道狭路上交错擦肩而过的车流之中，涂装着军用国防绿哑光漆的高机动车与中型越野卡车（中卡）的身影日渐频繁密集起来――",
    "当迎面与一辆重型96式轮式装甲运兵车擦肩而过时，视线与从车长指挥塔舱口（Cupola）探出半截身子的带车军官精准交叠，我下意识地险些抬手敬出一个标准的军礼。",

    # 484 - 493
    "@雄二@「…话说回来莳菜，你成天嚷嚷着自己社恐自闭不擅与生人交涉，我看你自来熟搭讪陌生人的本事分明出神入化得很嘛」",
    "@雄二@「不仅在美滨学园靠着人见人怜的弱气团宠地位作威作福，只要放到大马路上，我看你跟谁都能毫无心理负担地热络攀谈起来」",
    "@雄二@「前阵子在商业街的和菓子甜品铺长凳前，我还当场撞见你厚颜无耻地赖在一对素昧平生的白发老夫妻身边，蹭人家请客吃栗子红豆年糕汤的作案现场」",
    "@蒔菜@「太失礼了的说！被你这么一污蔑，搞得我好像是专门盯上丧失正常民事判断能力的痴呆孤寡老人、字面意义上疯狂敛财中饱私囊的极恶犯罪分子一样好不好！」",
    "@雄二@「可你当时明明摆着一副憨批般的呆滞傻笑，鼻孔里哼哧哼哧喷着热气，狼吞虎咽狂炫人家的栗子年糕汤吃得正欢不是吗」",
    "@蒔菜@「我确实是吃了呀！吃了是吃了！可那分明是老爷爷老奶奶慈祥地主动问我『小姑娘要尝一碗吗？』，我才礼貌答应点头的嘛！」",
    "@蒔菜@「我可绝对没有主动向对方敲诈勒索提出物质索求好不好！？」",
    "@雄二@「那么请问，你这般厚脸皮的豪横做派，到底哪一点能跟『认生社恐』这四个字沾得上哪怕半毛钱边啊…」",
    "@蒔菜@「咕呜……我平时也不是逮着谁都主动凑上去搭话的好不好！我也是有经过严密的战术目标筛选甄别的好不好啦…」",
    "@雄二@「经你这么一辩解，你好像确实专挑那种慈眉善目、看起来脾气极好容易心软的孤寡老人下手啊」",

    # 494 - 503
    "@蒔菜@「所以说！你这措辞听起来怎么越来越像诈骗犯踩点了啊！？嘛……虽然事实确实八九不离十就是了…」",
    "@雄二@「是因为跟长辈老人待在一起不会产生戒备恐惧吗？」",
    "@蒔菜@「倒也不是不害怕……应该说是更有亲切感与熟悉感吧」",
    "@蒔菜@「你看嘛，我以前在封闭疗养院的住院部病房里整整与世隔绝躺了六年，那段漫长的暗无天日岁月里，身边的医护和病友全都是上了岁数的老头老太太」",
    "@蒔菜@「所以我本能地就觉得老爷爷老奶奶身上的气场非常温和无害，反倒是跟我年纪相仿的平辈年轻人，我完全不知道该拿什么表情去应对」",
    "@雄二@「原来如此……」",
    "由于那场血腥残暴的灭门内斗，莳菜在幼年时期便被剥夺了与同龄伙伴建立正常社交羁绊的成长阶段。",
    "对她而言，同龄人的喧闹、竞争与无法捉摸的心机反倒成了令人退避三舍的未知名状恐惧，而医院里那些行将就木的平和老人，才是她赖以重构安全感的心灵庇护所。",
    "@雄二@「这么说来，当初我刚转学踏进美滨学园教室的时候，你岂不是对我充满了敌意与戒备？」",
    "@蒔菜@「嗯……最初确实挺提防你的。因为爸爸身上总散发着一股跟普通男高中生截然不同的冷冽血腥味」",

    # 504 - 513
    "@蒔菜@「但不可思议的是，没过多久我就发觉，爸爸跟同龄那些轻浮毛躁的小男生完全不一样」",
    "@蒔菜@「周身的气场异常沉稳内敛，脊梁骨里仿佛自始至终钉死着一根绝不产生分毫动摇的钢铁中轴，就像……怎么形容呢？」",
    "@蒔菜@「就像旧时代的日本武士？或者英姿勃发的少年剑客……？总觉得你身上透着那股沉静的决绝」",
    "@雄二@「经你这么一提……以前放假在宿舍擦拭保养工作枪械刀具时，从旁路过的JB也曾冷嘲热讽挖苦我说『简直像个江户时代靠糊雨伞维持生计的落魄浪人武士』呢…」",
    "@蒔菜@「啊！对对对！就是那个味儿！太传神贴切了的说！」",
    "@雄二@「沉醉在枯燥乏味的精密打磨工作中确实合我的胃口……但我怎么也没料到有朝一日会被人比作糊雨伞的浪人啊…」",
    "自正午前夕驶离美滨宿舍大门算起，晃晃悠悠已然颠簸了整整两个半小时的漫长路途。",
    "一旦顺着记忆拐上那条阔别已久的熟悉县道，便彻底抛开了对导航地图的依赖，唯有扭大油门咬牙在蜿蜒狭窄的险峻盘山隘口上死命攀爬。",
    "山间林道随着海拔拔高而急剧收窄，虽然路面早年铺设过简易柏油沥青，但路幅宽度狭窄得基本与农用拖拉机田埂机耕道无异，倘若迎面撞上对向来车，两辆机车连擦肩会车的冗余空间都荡然无存。",
    "不过，在这条绝壁山道上撞见对向来车的概率，基本等同于零。",

    # 514 - 523
    "因为盘山公路的尽头终点，除了一座孤零零矗立在断崖顶端的移动通信营运商微波中继信号铁塔之外，便唯有一扇深锁着整片原始国有林场禁区的锈蚀铁门。",
    "若非要预设会车情境，那大抵也唯有微波塔的例行巡检维护技工，或者不幸被导航误导误入歧途的倒霉外地自驾游游客了吧。",
    "周防天音那辆重度改装的“鲍巴太郎”，硬生生驮着两具成年人与少女的肉体负重，",
    "在坡度陡峭达$[$b１５度$]、局部急弯甚至逼近惊人二十六度的极限制动仰角山崖上，气喘吁吁地伴随着发动机气门挺杆（Tappet）高频暴躁的咔嗒咔嗒敲击杂音，艰难而倔强地死命向上攀爬。",
    "当接连掠过三面每隔一百米便立在杂草丛中的猩红『前方区域·非公干闲人绝对禁止入内』警示铁牌之后，那扇被重锁深锁的生锈铁门，终于在浓荫密林深处赫然显露出了狰狞森严的轮廓。",
    "@雄二@「…到了，莳菜」",
    "@蒔菜@「呼咻……好耶」",
    "莳菜连裙摆都顾不上整理，大大咧咧劈开双腿便从后排单薄的皮革小马鞍座上纵身跃下。",
    "@蒔菜@「哎呦喂呀——！屁股要裂开两半了啦！搞不好骨盆都磨出血来了的说！」",
    "我背对着隔着裙料死命揉搓生疼的屁股、宛如追逐自己尾巴的幼犬般原地打转试图肉眼检视伤势的莳菜，",
    "反手将那柄沉甸甸的钥匙精准插进了悬挂在林场铁大门中央的古旧大黄铜挂锁之中。",

    # 524 - 533
    "@蒔菜@「这里就是爸爸以前隐居的深山老林吗？」",
    "@雄二@「准确地讲，这是隶属于国家林野厅管辖的国有林场。我和师父当年是以护林防火管理员的受聘身份，长年寄宿在山林腹地的小木屋里」",
    "@蒔菜@「那木屋建在什么方位呀？放眼望去连个房顶都瞧不见耶…」",
    "@雄二@「这个嘛……从这扇铁门徒步往里跋涉，大概需要整整三十分钟左右吧」",
    "@蒔菜@「哇擦！纯靠两条腿走过去吗！？」",
    "@雄二@「可能的话我也巴不得直接骑着机车长驱直入，但眼前这段铺满碎石断崖的极端乱石碎石坡（Gravel），鲍巴太郎无论如何也是寸步难行的…」",
    "推开沉重铁门的瞬间，呈现在眼前的，是一条全线密布着拳头大小尖锐碎石的原始林间便道，纵深仰角目测至少横亘在三十度以上的骇人绝壁――",
    "若非配备分时四驱高低速分动箱的专业硬派越野吉普车，抑或是脚踏大齿深坑菠萝越野轮胎的专业越野林道泥地摩托车，寻常车辆硬闯无异于自寻死路。",
    "天音这辆鲍巴太郎原本就属于毫无减震行程的公路贴地巡航改装，底盘离地间隙被病态下压到了贴地极限，",
    "一旦硬闯这等嶙峋乱石滩，百分之百会在第一个石坎上当场托底卡死油底壳撞烂发动机机匣。",

    # 534 - 547
    "@蒔菜@「…难道说……咱们真的要在这种陡得要命的山石绝壁上徒步攀爬半个钟头吗…？」",
    "@雄二@「放心，险峻的只有铁门开头的这短短一段。只要挺过前三十米盲区，林道腹地的纵深坡度便会迅速舒缓下来」",
    "@蒔菜@「呜呜……没辙啦，权当是进行一场轻量级的深山野足拉练登山郊游好了的说…」",
    "在铁门前方的山道半坡上，我将鲍巴太郎的车头调转向上、后轮稳稳抵住路肩，挡位死死锁在机械一挡以防溜坡停稳，顺手将莳菜背上那只鼓鼓囊囊的双肩野餐背包解下反扣在自己的肩头，",
    "旋即，我和莳菜二人并肩迈开大步，正式踏进了这片被钢铁栅栏深锁隔离的幽邃国有林莽深处。"
]

assert len(lines) == 274, f"Count is {len(lines)}"

with open("scripts/mak_008a_part2.py", "w", encoding="utf-8") as f:
    f.write("# scripts/mak_008a_part2.py\n")
    f.write("mak_008a_part2 = [\n")
    for l in lines:
        f.write(f"    {repr(l)},\n")
    f.write("]\n")

print(f"Successfully generated scripts/mak_008a_part2.py with {len(lines)} lines.")
